---
kind: property
id: P:Autodesk.Revit.DB.DirectShapeTypeOptions.AllowDuplicateNames
source: html/ed44da9c-3ef7-7768-a442-b17241f9cbf7.htm
---
# Autodesk.Revit.DB.DirectShapeTypeOptions.AllowDuplicateNames Property

Determines whether or not duplicate DirectShapeType names are allowed.

## Syntax (C#)
```csharp
public bool AllowDuplicateNames { get; set; }
```